Revit 2027 API
ParameterTypeId.LegendComponentLength Property
 "Host Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LegendComponentLength { get; }
Public Shared ReadOnly Property LegendComponentLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LegendComponentLength {
	ForgeTypeId^ get ();
}
static member LegendComponentLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace